html/rust/test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>测试</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="generic.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">测试</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0d85f1">如何编写测试</a>
<ul>
<li><a href="#orge57b548">测试函数剖析</a></li>
<li><a href="#org114a098">使用 assert! 宏来检查结果</a></li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example">
Edsger W. Dijkstra 在其 1972 年的文章"The Humble Programmer"中说到"Program testing can be a very effective way to show the presence of bugs, but it is hopelessly inadequate for showing their absence"

这并不意味着我们不该尽可能地测试软件！
</pre>

<p>
程序的正确性意味着代码如期望的那样运行。Rust 是一个相当注重正确性的编程语言，不过正确性是一个难以证明的复杂主题。Rust 的类型系统在此问题上下了很大的功夫，不过它不可能捕获所有种类的错误。为此，Rust 也在语言本身包含了编写软件测试的支持
</p>

<pre class="example">
例如，可以编写一个叫做 add_two 的将传递给它的值加二的函数。它的签名有一个整型参数并返回一个整型值

当实现和编译这个函数时，Rust 会进行所有目前我们已经见过的类型检查和借用检查，例如，这些检查会确保我们不会传递 String 或无效的引用给这个函数

Rust 所不能检查的是这个函数是否会准确的完成我们期望的工作：返回参数加二后的值，而不是比如说参数加 10 或减 50 的值！这也就是测试出场的地方

我们可以编写测试断言，比如说，当传递 3 给 add_two 函数时，返回值是 5。无论何时对代码进行修改，都可以运行测试来确保任何现存的正确行为没有被改变
</pre>

<p>
测试是一项复杂的技能：虽然不能在一个章节的篇幅中介绍如何编写好的测试的每个细节，但还是会讨论 Rust 测试功能的机制。我们会讲到编写测试时会用到的 <span class="underline">注解</span> 和 <span class="underline">宏</span> ，运行测试的 <span class="underline">默认行为</span> 和选项，以及如何将测试 <span class="underline">组织</span> 成单元测试和集成测试
</p>
<div id="outline-container-orgc0d85f1" class="outline-2">
<h2 id="orgc0d85f1">如何编写测试</h2>
<div class="outline-text-2" id="text-orgc0d85f1">
<p>
Rust 中的测试函数是用来 <b>验证</b> 非测试代码是否按照期望的方式运行的。测试函数体通常执行如下三种操作：
</p>
<ol class="org-ol">
<li>设置任何所需的数据或状态</li>
<li>运行需要测试的代码</li>
<li>断言其结果是所期望的</li>
</ol>

<p>
看看 Rust 提供的专门用来编写测试的功能： <span class="underline">test 属性</span> 、一些 <span class="underline">宏</span> 和 <span class="underline">should_panic 属性</span> 
</p>
</div>
<div id="outline-container-orge57b548" class="outline-3">
<h3 id="orge57b548">测试函数剖析</h3>
<div class="outline-text-3" id="text-orge57b548">
<p>
作为最简单例子，Rust 中的测试就是一个带有 <span class="underline">test 属性</span> 注解的 <span class="underline">函数</span> 。属性是关于 Rust 代码片段的元数据
</p>
<pre class="example">
前面的结构体中用到的 derive 属性就是一个例子
</pre>
<p>
为了将一个函数变成测试函数，需要在 <span class="underline">fn 行</span> 之前加上 <span class="underline">#[test]</span> 。当使用 <span class="underline">cargo test</span> 命令运行测试时，Rust 会构建一个测试执行程序用来调用标记了 test 属性的函数，并报告每一个测试是通过还是失败
</p>

<pre class="example">
  当使用 Cargo 新建一个库项目时，它会自动生成一个测试模块和一个测试函数

  这有助于开始编写测试，因为这样每次开始新项目时不必去查找测试函数的具体结构和语法了

  当然也可以额外增加任意多的测试函数以及测试模块！
</pre>

<p>
创建一个新的库项目 adder，adder 库中 src/lib.rs 的内容应该看起来：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #7fffd4;">#[cfg(test)]</span>
<span style="color: #00ffff;">mod</span> <span style="color: #7fffd4;">tests</span> {
    <span style="color: #7fffd4;">#[test]</span>
    <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">it_works</span>() {
        <span style="color: #7fffd4;">assert_eq!</span>(2 + 2, 4);
    }
}
</pre>
</div>

<pre class="example">
现在暂时忽略 tests 模块和 #[cfg(test)] 注解，并只关注函数来了解其如何工作
</pre>

<p>
注意： fn 行之前的 <span class="underline">#[test]</span> ：这个属性表明这是一个测试函数，这样测试执行者就知道将其作为测试处理
</p>
<pre class="example">
因为也可以在 tests 模块中拥有非测试的函数来帮助我们建立通用场景或进行常见操作，所以需要使用 #[test] 属性标明哪些函数是测试
</pre>

<p>
函数体通过使用 <span class="underline">assert_eq! 宏</span> 来断言 2 加 2 等于 4。一个典型的测试的格式，就是像这个例子中的断言一样
</p>

<p>
接下来运行就可以看到测试通过。 <span class="underline">cargo test</span> 命令会运行项目中所有的测试，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cargo test
   Compiling adder v0.1.0 (file:///projects/adder)
    Finished dev [unoptimized + debuginfo] target(s) <span style="color: #00ffff;">in</span> 0.22 secs
     Running target/debug/deps/adder-ce99bcc2479f4607

running 1 test
<span style="color: #b0c4de;">test</span> tests::it_works ... ok

<span style="color: #b0c4de;">test</span> result: ok. 1 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out

   Doc-tests adder

running 0 tests

<span style="color: #b0c4de;">test</span> result: ok. 0 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out
</pre>
</div>

<p>
Cargo 编译并运行了测试。在 Compiling、Finished 和 Running 这几行之后：
</p>
<ul class="org-ul">
<li>首先看到 running 1 test 这一行</li>
<li>下一行显示了生成的 <span class="underline">测试函数的名称</span> ，它是 <span class="underline">it_works</span> ，以及测试的运行结果 <span class="underline">ok</span></li>
<li>接着可以看到 <span class="underline">全体测试运行结果</span> 的 <b>摘要</b> ：
<ul class="org-ul">
<li><span class="underline">test result: ok.</span> 意味着 <b>所有测试都通过</b> 了</li>
<li><span class="underline">1 passed; 0 failed</span> 表示 <b>通过</b> 或 <b>失败</b> 的测试数量</li>
<li>因为之前并 <b>没有将任何测试标记为忽略</b> ，所以摘要中会显示 <span class="underline">0 ignored</span></li>
<li>也 <b>没有过滤</b> 需要运行的测试，所以摘要中会显示 <span class="underline">0 filtered out</span></li>
<li><span class="underline">0 measured</span> 统计是针对 <b>性能测试</b> 的</li>
</ul></li>
<li>测试输出中的以 <span class="underline">Doc-tests adder</span> 开头的这一部分是所有 <b>文档测试</b> 的结果</li>
</ul>

<pre class="example">
  现在并没有任何文档测试，不过 Rust 会编译任何在 API 文档中的代码示例

  这个功能帮助我们使文档和代码保持同步
</pre>

<p>
改变测试的名称并看看这如何改变测试的输出。给 it_works 函数起个不同的名字，比如 exploration，像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #7fffd4;">#[cfg(test)]</span>
<span style="color: #00ffff;">mod</span> <span style="color: #7fffd4;">tests</span> {
    <span style="color: #7fffd4;">#[test]</span>
    <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">exploration</span>() {
        <span style="color: #7fffd4;">assert_eq!</span>(2 + 2, 4);
    }
}
</pre>
</div>
<p>
并再次运行 cargo test。现在输出中将出现 exploration 而不是 it_works：
</p>
<div class="org-src-container">
<pre class="src src-sh">running 1 test
<span style="color: #b0c4de;">test</span> tests::exploration ... ok

<span style="color: #b0c4de;">test</span> result: ok. 1 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out

   Doc-tests adder

running 0 tests

<span style="color: #b0c4de;">test</span> result: ok. 0 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out
</pre>
</div>

<p>
再增加另一个测试，不过这一次是一个会失败的测试：
</p>
<ul class="org-ul">
<li>当测试函数中出现 <span class="underline">panic</span> 时测试就 <b>失败</b> 了</li>
<li>每一个测试都在一个新线程中运行，当主线程发现测试线程异常了，就将对应测试标记为失败</li>
</ul>
<pre class="example">
已经知道最简单的造成 panic 的方法：调用 panic! 宏
</pre>
<p>
写入新测试 another 后， src/lib.rs 现在看起来如示例所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #7fffd4;">#[cfg(test)]</span>
<span style="color: #00ffff;">mod</span> <span style="color: #7fffd4;">tests</span> {
    <span style="color: #7fffd4;">#[test]</span>
    <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">exploration</span>() {
        <span style="color: #7fffd4;">assert_eq!</span>(2 + 2, 4);
    }

    <span style="color: #7fffd4;">#[test]</span>
    <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">another</span>() {
        <span style="color: #7fffd4;">panic!</span>(<span style="color: #ffa07a;">"Make this test fail"</span>);
    }
}
</pre>
</div>

<p>
再次 cargo test 运行测试。输出它表明 exploration 测试通过了而 another 失败了：
</p>

<div class="org-src-container">
<pre class="src src-sh">running 2 tests
<span style="color: #b0c4de;">test</span> tests::exploration ... ok
<span style="color: #b0c4de;">test</span> tests::another ... FAILED

failures:

---- tests::another stdout ----
thread <span style="color: #ffa07a;">'tests::another'</span> panicked at <span style="color: #ffa07a;">'Make this test fail'</span>, src/lib.rs:10:9
note: Run with <span style="color: #fa8072;">`RUST_BACKTRACE=1`</span> <span style="color: #00ffff;">for</span> a backtrace.

failures:
    tests::another

<span style="color: #b0c4de;">test</span> result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out

error: test failed
</pre>
</div>

<p>
<span class="underline">test tests::another</span> 这一行是 <span class="underline">FAILED</span> 而不是 ok 了。在单独测试结果和摘要之间多了两个新的部分：
</p>
<ul class="org-ul">
<li>第一个部分：显示了测试 <span class="underline">失败的详细原因</span></li>
</ul>
<pre class="example">
  在这个例子中，another 因为在src/lib.rs 的第 10 行 panicked at 'Make this test fail' 而失败
</pre>
<ul class="org-ul">
<li>第二个部分：列出了 <span class="underline">所有失败的测试</span></li>
</ul>

<pre class="example">
  这在有很多测试和很多失败测试的详细输出时很有帮助

  可以通过使用失败测试的名称来只运行这个测试，以便调试
</pre>

<p>
最后是 <span class="underline">摘要行</span> ：总体上讲，测试结果是 <span class="underline">FAILED</span> 。有一个测试通过和一个测试失败
</p>

<pre class="example">
  现在见过不同场景中测试结果是什么样子的了，再来看看除 panic! 之外的一些在测试中有帮助的宏吧
</pre>
</div>
</div>
<div id="outline-container-org114a098" class="outline-3">
<h3 id="org114a098">使用 assert! 宏来检查结果</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
